import { IFeatures } from "@/shared/types/features.types";

export const features: IFeatures[] = [
  {
    id: 1,
    title: "Персоналізовані профілі",
    description:
      "Створюйте унікальні профілі, які відображають ваші навички і досягнення в найкращому світлі.",
  },
  {
    id: 2,
    title: "Гнучкість налаштувань",
    description:
      "Налаштовуйте вигляд та функціонал вашого профілю згідно з вашими потребами та вподобаннями.",
  },
  {
    id: 3,
    title: "Портфоліо проєктів",
    description:
      "Демонструйте свої професійні досягнення, додавши проєкти з описами та зображеннями.",
  },
  {
    id: 4,
    title: "Зворотний зв'язок",
    description:
      "Отримуйте оцінки та відгуки від колег і клієнтів, щоб покращити свої навички.",
  },
  {
    id: 5,
    title: "Навчання та розвиток",
    description:
      "Отримуйте рекомендації щодо курсів та тренінгів, які допоможуть вам підвищити свій професійний рівень.",
  },
  {
    id: 6,
    title: "Соціальна взаємодія",
    description:
      "Знаходьте колег та партнерів для співпраці або обміну досвідом через мережу 'My Skills'.",
  },
  {
    id: 7,
    title: "Аналітика профілю",
    description:
      "Отримуйте звіти та статистику про взаємодію з вашим профілем для кращого розуміння його ефективності.",
  },
  {
    id: 8,
    title: "Мобільна сумісність",
    description:
      "Доступ до вашого профілю з будь-якого пристрою для зручного управління і оновлення.",
  },
];
